# 1. Базовый образ с установленным Python (берем легкую версию alpine на базе linux)
FROM python:3.12-slim

# 2. Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# 3. Копируем файл зависимостей в контейнер
COPY requirements.txt .

# 4. Устанавливаем библиотеки без сохранения кэша (чтобы образ весил меньше)
RUN pip install --no-cache-dir -r requirements.txt

# 5. Копируем все остальные файлы проекта (код, шаблоны, статику) в контейнер
COPY . .

# 6. Открываем порт 8000 для связи с внешним миром
EXPOSE 8000

# 7. Команда для запуска приложения при старте контейнера
CMD ["uvicorn", "main:app", "--host", "0.0.0.0", "--port", "8000"]